#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.instance-assume-role-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "instance-assume-role-policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithSAML",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "https://signin.aws.amazon.com/saml",
                ]
              + variable = "SAML:aud"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_saml_provider.saml_provider["975678609170"] will be created
  + resource "aws_iam_saml_provider" "saml_provider" {
      + arn                    = (known after apply)
      + id                     = (known after apply)
      + name                   = "Okta-SSO"
      + saml_metadata_document = (known after apply)
      + tags                   = {
          + "Name" = "okta sso saml provider"
        }
      + tags_all               = {
          + "Name" = "okta sso saml provider"
        }
      + valid_until            = (known after apply)
    }

  # module.saml-app.okta_app_saml.saml_app["975678609170"] will be created
  + resource "okta_app_saml" "saml_app" {
      + accessibility_self_service = false
      + app_links_json             = jsonencode(
            {
              + login = true
            }
        )
      + app_settings_json          = jsonencode(
            {
              + appFilter           = "okta"
              + awsEnvironmentType  = "aws.amazon"
              + domain              = "975678609170"
              + groupFilter         = "^app\\-aws\\-(?{{accountid}}\\d+)\\-(?{{role}}[\\w\\-]+)$"
              + identityProviderArn = "aws_iam_saml_provider.Okta-SSO.arn"
              + joinAllRoles        = "true"
              + loginURL            = "https://console.aws.amazon.com/ec2/home"
              + roleValuePattern    = "arn:aws:iam::${accountid}:saml-provider/Okta-SSO,arn:aws:iam::${accountid}:role/${role}"
              + sessionDuration     = "3600"
              + useGroupMapping     = "true"
            }
        )
      + auto_submit_toolbar        = false
      + certificate                = (known after apply)
      + entity_key                 = (known after apply)
      + entity_url                 = (known after apply)
      + hide_ios                   = false
      + hide_web                   = false
      + honor_force_authn          = false
      + http_post_binding          = (known after apply)
      + http_redirect_binding      = (known after apply)
      + id                         = (known after apply)
      + key_id                     = (known after apply)
      + label                      = "AWS 975678609170"
      + logo_url                   = (known after apply)
      + metadata                   = (known after apply)
      + metadata_url               = (known after apply)
      + name                       = (known after apply)
      + preconfigured_app          = "amazon_aws"
      + saml_version               = "2.0"
      + sign_on_mode               = (known after apply)
      + skip_groups                = false
      + skip_users                 = false
      + status                     = "ACTIVE"
      + user_name_template         = "${source.login}"
      + user_name_template_type    = "BUILT_IN"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "google_workspace_pass"
│ but a value was found in file
│ "/github/workspace/staging/accounts/aws-app/../../../common.tfvars". If you
│ meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "vault_google_credentials_path" but a value was found in file
│ "/github/workspace/staging/accounts/aws-app/../../../common.tfvars". If you
│ meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 12 other variable(s)
│ defined without being declared.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
time=2022-01-12T04:50:38Z level=error msg=1 error occurred:
	* exit status 2
```

</details>

*Workflow: `Terragrunt AWS App`, Action: `__the-commons-project_terragrunt-github-actions_4`, Working Directory: `./staging/accounts/aws-app/`, Workspace: `default`*
